In [1]:
import pandas as pd
df = pd.read_csv("file//salary.csv")
df

  experience  test_scored  inteview_scored  salary
0        NaN          8.0                9   50000
1        NaN          8.0                6   45000
2       five          6.0                7   60000
3        two         10.0               10   65000
4      seven          9.0                6   70000
5      three          7.0               10   62000
6        ten          NaN                7   72000
7     eleven          7.0                8   80000

In [3]:
assume = df['test_scored'].median()

In [4]:
ndf = df.fillna({'experience':'zero','test_scored':assume})
ndf

  experience  test_scored  inteview_scored  salary
0       zero          8.0                9   50000
1       zero          8.0                6   45000
2       five          6.0                7   60000
3        two         10.0               10   65000
4      seven          9.0                6   70000
5      three          7.0               10   62000
6        ten          8.0                7   72000
7     eleven          7.0                8   80000

In [5]:
from word2number import w2n
def change(i):
    return w2n.word_to_num(i)
for i in range(len(ndf.experience)):
    ndf.experience[i]= change(ndf.experience[i])

<ipython-input-5-56c2dc8dd59e>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ndf.experience[i]= change(ndf.experience[i])

In [6]:
ndf

  experience  test_scored  inteview_scored  salary
0          0          8.0                9   50000
1          0          8.0                6   45000
2          5          6.0                7   60000
3          2         10.0               10   65000
4          7          9.0                6   70000
5          3          7.0               10   62000
6         10          8.0                7   72000
7         11          7.0                8   80000

In [7]:
from sklearn import linear_model
reg = linear_model.LinearRegression()
reg.fit(ndf[['experience','test_scored','inteview_scored']],ndf.salary)

LinearRegression()

In [8]:
reg.predict([[8,10,10]])

array([80750.36390102])

In [9]:
result = [[0,8,9],[0,2,4],[3,9,5],[30,5,10],[20,5,10]]
r = pd.DataFrame(result,columns = ['experience','test_scored','interview_scored'])
r

   experience  test_scored  interview_scored
0           0            8                 9
1           0            2                 4
2           3            9                 5
3          30            5                10
4          20            5                10

In [11]:
px = reg.predict(r)

In [12]:
r['price'] = px
r

   experience  test_scored  interview_scored          price
0           0            8                 9   52350.072780
1           0            2                 4   30249.636099
2           3            9                 5   53813.682678
3          30            5                10  133406.841339
4          20            5                10  105277.292576

In [14]:
r.to_csv("salary_prediction.csv",index = False)